# 数据字段名称
rec_columns = [
    'Index', 'Cycle', 'Step', 'Status', 'Time', 'Voltage',
    'Current(mA)', 'Charge_Capacity(mAh)', 'Discharge_Capacity(mAh)',
    'Charge_Energy(mWh)', 'Discharge_Energy(mWh)', 'Timestamp']

# 定义字段精度
dtype_dict = {
    'Index': 'uint32',
    'Cycle': 'uint16',
    'Step': 'uint32',
    'Status': 'category',
    'Time': 'float32',
    'Voltage': 'float32',
    'Current(mA)': 'float32',
    'Charge_Capacity(mAh)': 'float32',
    'Discharge_Capacity(mAh)': 'float32',
    'Charge_Energy(mWh)': 'float32',
    'Discharge_Energy(mWh)': 'float32'
}

aux_dtype_dict = {
    'V': 'float32',
    'T': 'float32',
    't': 'float32'
}

# 将状态整数映射到字符串的字典
state_dict = {
    1: 'CC_Chg',        # 恒流充电：以固定电流将电池从低SOC快速充电
    2: 'CC_DChg',       # 恒流放电：容量测试、倍率性能测试的基础放电方式
    3: 'CV_Chg',        # 恒压充电：电压维持在上限，电流随极化衰减，确保不因过压造成析锂
    4: 'Rest',          # 静置/开路休息：渐近热-电化学平衡，用于测量OCV或消除极化
    5: 'Cycle',         # 循环：将一组步骤按设定循环N次，统计容量衰减、库伦效率等
    7: 'CCCV_Chg',      # 恒流-恒压充电：业界标准CC→CV两段式充电曲线
    8: 'CP_DChg',       # 恒功率放电：用固定功率加载，评估能量型电池在功率型工况下的热-电耦合行为
    9: 'CP_Chg',        # 恒功率充电：以固定功率快速补能，多用于大功率EV验证
    10: 'CR_DChg',      # 恒电阻放电：通过固定负载电阻考察电池在电压衰减中的电流-功率变化
    13: 'Pause',        # 暂停：手动/脚本临停，不计入容量；便于换线或更改步序
    16: 'Pulse',        # 脉冲：典型如HPPC测试，数秒放电/回充脉冲+休息，提取Rs、τ等参数
    17: 'SIM',          # 工况仿真：导入行车或负载波形文件，按时间序列重现真实功率曲线
    19: 'CV_DChg',      # 恒压放电：给电芯恒压"拉流"直至到达截止电流，多见于材料研究或BMS失效保护场景
    20: 'CCCV_DChg',    # 恒流-恒压放电：先定I拉到下限电压，再恒压拉小电流，模拟功率器件"掉电保持"过程
    21: 'Control',      # 控制/条件跳转：根据IF/DO条件改变流程（如电压阈值、时间、温度）
    22: 'OCV',          # 开路电压采样：长静置后测Voc，在SoC建模与老化诊断中必不可少
    26: 'CPCV_DChg',    # 恒功率-恒压放电：先等功率输出，电压触阈后转CV，避免过放又保持功率稳定
    27: 'CPCV_Chg'      # 恒功率-恒压充电：当功率阶段结束后用CV收尾，既能高效快充又降低末段热应力
}

# 根据仪器量程设置定义字段缩放
multiplier_dict = {
    -100000000: 10,
    -200000: 1e-2,
    -100000: 1e-2,
    -60000: 1e-2,
    -30000: 1e-2,
    -50000: 1e-2,
    -20000: 1e-2,
    -12000: 1e-2,
    -10000: 1e-2,
    -6000: 1e-2,
    -5000: 1e-2,
    -3000: 1e-2,
    -2000: 1e-2,
    -1000: 1e-2,
    -500: 1e-3,
    -100: 1e-3,
    -50: 1e-4,
    -25: 1e-4,
    -20: 1e-4,
    -10: 1e-4,
    -5: 1e-5,
    -2: 1e-5,
    -1: 1e-5,
    0: 0,
    1: 1e-4,
    2: 1e-4,
    5: 1e-4,
    10: 1e-3,
    20: 1e-3,
    50: 1e-3,
    100: 1e-2,
    200: 1e-2,
    250: 1e-2,
    500: 1e-2,
    1000: 1e-1,
    6000: 1e-1,
    10000: 1e-1,
    12000: 1e-1,
    20000: 1e-1,
    30000: 1e-1,
    40000: 1e-1,
    50000: 1e-1,
    60000: 1e-1,
    100000: 1e-1,
    200000: 1e-1,
}
